---
kind: method
id: M:Autodesk.Revit.UI.UIView.GetWindowRectangle
source: html/367a22fe-99b5-f4d8-e58b-881f65d15323.htm
---
# Autodesk.Revit.UI.UIView.GetWindowRectangle Method

Gets the rectangle containing the coordinates of the view's drawing area.

## Syntax (C#)
```csharp
public Rectangle GetWindowRectangle()
```

## Returns
The rectangle of the view window.